Tekla.Structures.Model.ModelObjectSelector
The ModelObjectSelector class can be used to make different model object selections
from the current model.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Model Model = new Model();
ModelObjectSelector Selector = Model.GetModelObjectSelector();
foreach(ModelObject MO in Selector)
{
Beam B = MO as Beam;
if(B != null)
{
Solid solid = B.GetSolid();
}
}
}
}